[{
    "protagonist_intro": "The protagonist, Rose DeWitt Bukater, is introduced as a young, wealthy woman who feels trapped in her privileged life. Her engagement to Cal Hockley, a wealthy but controlling man, emphasizes her desire for freedom and adventure. Jack Dawson, the other protagonist, is depicted as a free-spirited and adventurous artist who wins a ticket to board the Titanic in a poker game.",
    "inciting_incident": "The inciting incident occurs when Rose attempts to commit suicide by jumping off the Titanic's stern. Jack intervenes and saves her, leading to a bond between them. This event sets the stage for the central conflict of the story as Jack and Rose fall in love despite their different social backgrounds.",
    "rising_action": "The rising action develops through a series of events that bring Jack and Rose closer. They spend time together, defying social norms, and Jack introduces Rose to a world of freedom and spontaneity. Their romance blossoms, much to Cal's disapproval, leading to escalating tensions. Key scenes include the iconic 'I'm flying' moment at the ship's bow and the passionate encounter in the car.",
    "climax": "The climax of the story occurs as the Titanic hits an iceberg and begins to sink. Amidst the chaos, Jack and Rose fight to survive. The tension peaks when Jack is handcuffed below deck, and Rose bravely ventures into the flooding ship to rescue him. Their struggle against the rising waters and their determination to stay together heightens the emotional intensity.",
    "resolution": "The resolution unfolds as the Titanic sinks and Jack and Rose find temporary refuge on a piece of debris. Jack sacrifices his life to keep Rose afloat, ensuring her survival. As rescue boats arrive, Rose is saved and watches Jack slip away into the icy depths, marking the end of their brief but profound love affair.",
    "consequences": "The immediate aftermath shows Rose being rescued and taken aboard the Carpathia. She decides to abandon her former identity, adopting the name Rose Dawson as a tribute to Jack. This decision signifies her new beginning and the profound impact Jack had on her life. She chooses to live a life of freedom, inspired by Jack's spirit.",
    "final_outcome": "The final outcome reveals Rose as an elderly woman, recounting her story to the treasure hunters aboard the Keldysh. She reflects on her life, the love she shared with Jack, and the promise she made to him to live fully. The story ends with a dream-like sequence where Rose is reunited with Jack on the Titanic, surrounded by those who perished, suggesting a spiritual reunion.",
    "loose_ends": "The script leaves some loose ends, such as the fate of Cal Hockley and other characters, but these are minor compared to the main storyline. The mystery of the 'Heart of the Ocean' diamond is resolved when Rose drops it into the ocean, symbolizing her letting go of the past and her final tribute to Jack.",
    "subplots": "Several subplots enrich the narrative, including the stories of other passengers like Molly Brown, Captain Smith, and Mr. Andrews. These subplots provide a broader context to the tragedy of the Titanic and highlight various themes such as heroism, sacrifice, and the class divide."
}]