[{
    "main_theme": "The central theme of 'The Mummy' revolves around the concept of eternal love and the lengths one will go to reclaim it. Imhotep's resurrection and his quest to bring Anck-su-namun back to life drive the plot, illustrating the power and peril of undying love.",
    "secondary_themes": {
        "courage_and_resilience": "The story showcases the bravery and determination of the main characters, particularly Rick O'Connell and Evelyn Carnarvon, as they face various supernatural and mortal dangers to stop Imhotep and protect humanity.",
        "legacy_and_heritage": "The film delves into the importance of legacy, seen through the historical artifacts and ancient curses that link the past to the present. The characters' respect for and interactions with these legacies shape their journey.",
        "betrayal_and_deception": "Betrayal is a recurring element, from Anck-su-namun and Imhotep's betrayal of Pharaoh Seti, to Beni's multiple betrayals of his comrades. These acts add tension and complexity to the narrative."
    },
    "tertiary_themes": {
        "superstition_vs_rationality": "The clash between modern scientific understanding and ancient superstitions is evident as characters like Evelyn, a scholar, confront the supernatural events they encounter.",
        "greed_and_ambition": "Greed drives many characters, such as Beni and the American treasure hunters, highlighting the destructive potential of unchecked ambition.",
        "sacrifice": "The theme of sacrifice is illustrated through characters like Anck-su-namun, who sacrifices herself for Imhotep, and the sacrifices made by the protagonists to protect each other and the world."
    },
    "resolution_main_theme": "The theme of eternal love is resolved with the final defeat of Imhotep, underscoring the dangers and ultimate futility of attempting to defy death and reclaim lost love through supernatural means.",
    "resolution_secondary_themes": {
        "courage_and_resilience": "Rick and Evelyn's courage is validated as they emerge victorious, having overcome supernatural and human threats. Their resilience cements their growth and mutual respect.",
        "legacy_and_heritage": "The resolution reaffirms the significance of respecting historical legacies, as the ancient artifacts and curses are safely contained, preventing further chaos.",
        "betrayal_and_deception": "Betrayal is dealt with as justice prevails, with Beni meeting his end due to his treacherous actions, and Imhotep being re-condemned to his cursed existence."
    },
    "resolution_tertiary_themes": {
        "superstition_vs_rationality": "The resolution balances the acceptance of supernatural realities with scientific inquiry, as Evelyn's knowledge helps neutralize the threats.",
        "greed_and_ambition": "Greed is shown to be self-destructive, as those driven by it, like the treasure hunters and Beni, face dire consequences.",
        "sacrifice": "The sacrifices made by the characters are honored in the resolution, emphasizing the value of selflessness and bravery in the face of overwhelming odds."
    }
}]
