[{
    "main_theme": "The central theme of 'Office Space' revolves around the disillusionment and ennui of white-collar work in a corporate environment. The narrative explores the monotonous, soul-crushing reality of office life, highlighting the sense of entrapment and lack of fulfillment experienced by employees.",
    "secondary_themes": {
        "rebellion_against_corporate_structure": "A significant secondary theme is the rebellion against corporate structures and authority. This is exemplified by Peter's change in attitude towards his job and his subsequent actions to subvert the company's operations.",
        "search_for_personal_freedom": "Another secondary theme is the search for personal freedom and authenticity. Characters like Peter seek to escape the confines of their cubicles and find a more meaningful existence outside the corporate grind.",
        "friendship_and_camaraderie": "The theme of friendship and camaraderie is evident through the relationships between Peter, Michael, and Samir. Their shared experiences and mutual support provide a counterpoint to the isolating nature of office work."
    },
    "tertiary_themes": {
        "technological_discontent": "The script touches on technological discontent, particularly through the frustrations characters face with office equipment like printers and software systems.",
        "individual_vs_system": "The individual vs. system theme is portrayed through the employees' struggles against the impersonal and often irrational demands of their corporate employer.",
        "corporate_dehumanization": "Corporate dehumanization is a recurring tertiary theme, highlighted by the reduction of employees to mere cogs in the corporate machine, exemplified by characters like Milton."
    },
    "resolution_main_theme": "By the end of the film, the main theme of disillusionment with corporate life is resolved through Peter's ultimate decision to leave the corporate world behind and seek a more fulfilling and authentic life. His journey reflects a rejection of the corporate grind and an embrace of personal freedom.",
    "resolution_secondary_themes": {
        "rebellion_against_corporate_structure": "The rebellion theme culminates with the destruction of Initech's office equipment and Peter's refusal to conform to corporate expectations, symbolizing a break from the oppressive corporate structure.",
        "search_for_personal_freedom": "Peter's pursuit of personal freedom is achieved as he takes up a construction job, finding satisfaction in tangible, meaningful work outside the office environment.",
        "friendship_and_camaraderie": "The bonds of friendship and camaraderie among Peter, Michael, and Samir are strengthened as they support each other through their schemes and ultimately face the consequences together, highlighting the importance of solidarity."
    },
    "resolution_tertiary_themes": {
        "technological_discontent": "Technological frustrations are symbolically resolved through the destruction of the troublesome printer, representing a cathartic release of pent-up frustrations with the impersonal tools of corporate life.",
        "individual_vs_system": "The individual vs. system theme is resolved as the characters find ways to subvert or escape the system, whether through criminal schemes or personal transformations, suggesting a victory of individuality over systemic oppression.",
        "corporate_dehumanization": "The theme of corporate dehumanization is poignantly resolved with Milton's eventual retaliation against Initech, symbolizing the breaking point of a dehumanized worker reclaiming his agency."
    }
}]
