[{
        "main_theme": "The central idea of 'Raiders of the Lost Ark' revolves around the relentless pursuit of extraordinary artifacts. Indiana Jones embodies the archetype of an adventurer driven by a deep-seated need to uncover historical treasures, often facing insurmountable odds and formidable foes. This theme is expressed through his exploration of ancient temples, confrontations with adversaries, and unwavering commitment to preserving significant historical artifacts.",
        "secondary_themes": {
            "courage_and_resilience": "Throughout the narrative, Indiana Jones demonstrates immense courage and resilience, overcoming physical and emotional challenges. His encounters with traps, enemies, and personal losses highlight his indomitable spirit and tenacity.",
            "loyalty_and_betrayal": "The film explores the concepts of loyalty and betrayal, particularly through Indy's interactions with allies and antagonists. Characters like Marion and Sallah showcase loyalty, while others, such as Belloq and various Nazis, highlight betrayal and deception.",
            "faith_and_superstition": "There is a strong undercurrent of faith and superstition that runs throughout the story. Characters often reference curses, the power of the Ark, and the mystical elements surrounding their quest, adding a layer of spiritual and supernatural tension."
        },
        "tertiary_themes": {
            "colonialism_and_exploitation": "The script includes elements of colonialism and exploitation, particularly in the way various characters seek to control and use ancient artifacts for personal gain or political power.",
            "gender_roles": "Marion's character challenges traditional gender roles, showcasing her strength, independence, and capability in a male-dominated world.",
            "environmental_awareness": "The settings, ranging from dense jungles to deserts, emphasize the beauty and peril of the natural world, subtly promoting an awareness of and respect for diverse environments."
        },
        "resolution_main_theme": "By the end of the narrative, the central theme of the pursuit of extraordinary artifacts is resolved through Indiana Jones's successful recovery of the Ark, despite numerous obstacles. His journey reaffirms the importance of historical preservation over personal gain, as well as the respect for the power and mystery of ancient artifacts.",
        "resolution_secondary_themes": {
            "courage_and_resilience": "Indy's resilience is rewarded as he emerges victorious despite numerous challenges. His bravery is acknowledged and solidified, demonstrating his growth as a character.",
            "loyalty_and_betrayal": "The bonds of loyalty are strengthened through the shared trials and triumphs of Indy and his allies, while betrayals are exposed and dealt with, reinforcing the importance of trust and integrity.",
            "faith_and_superstition": "The resolution acknowledges the power of faith and superstition, as the mystical elements surrounding the Ark play a crucial role in the climax, underscoring the narrative's spiritual dimensions."
        },
        "resolution_tertiary_themes": {
            "colonialism_and_exploitation": "The themes of colonialism and exploitation are addressed as the story concludes with a reflection on the ethical implications of artifact hunting and the responsibility that comes with it.",
            "gender_roles": "Marion's character continues to exemplify strength and independence, maintaining her role as a capable and equal partner in the adventure.",
            "environmental_awareness": "The conclusion leaves a lasting impression of the diverse and vibrant settings encountered, subtly encouraging respect for nature and an understanding of its significance."
        }
    }]
    