[{
    "main_theme": "The central theme of 'Indiana Jones and the Last Crusade' revolves around the pursuit of knowledge and the quest for discovery. This theme is embodied in Indiana Jones' relentless search for the Holy Grail, representing a deeper quest for truth, understanding, and personal enlightenment. The narrative underscores the importance of knowledge and history, while highlighting the personal growth and moral development that accompanies the journey.",
    "secondary_themes": {
        "father-son_relationship": "A significant secondary theme is the complex relationship between Indiana Jones and his father, Henry Jones Sr. Their dynamic explores themes of familial duty, misunderstanding, and reconciliation. The quest for the Grail becomes a journey of reconnection and mutual respect, revealing the emotional depths beneath their often strained interactions.",
        "faith_vs_reason": "The tension between faith and reason is a recurrent theme, as characters grapple with belief in the supernatural versus empirical evidence. Indiana Jones, a man of science and skepticism, is continually confronted with elements of faith, ultimately finding that some truths lie beyond the realm of logical explanation.",
        "legacy_and_identity": "The film delves into the concept of legacy, particularly through Indiana’s inheritance of his father's quest and scholarly pursuits. This theme examines how individuals define themselves in relation to their heritage and the expectations placed upon them, and how they carve their own identity while honoring their predecessors."
    },
    "tertiary_themes": {
        "good_vs_evil": "The classic struggle between good and evil is portrayed through the opposition between Indiana Jones and the Nazi antagonists. This conflict is not just physical but ideological, underscoring the moral imperatives driving the characters’ actions.",
        "sacrifice_and_redemption": "Themes of sacrifice and redemption are woven throughout the narrative, particularly in the characters' willingness to risk their lives for greater goods. The quest for the Grail is marked by moments of selflessness and the ultimate redemption found in pursuing noble ideals.",
        "adventure_and_exploration": "The spirit of adventure and exploration permeates the story, celebrating the thrill of discovery and the courage to venture into the unknown. This theme is reflected in the diverse and exotic locales visited by the characters, each presenting new challenges and wonders."
    },
    "resolution_main_theme": "The resolution of the central theme comes with the realization that the true Grail is not just a physical object but a symbol of spiritual enlightenment and personal growth. Indiana’s ultimate decision to let go of the Grail to save his father signifies the triumph of personal connection and moral values over the mere pursuit of knowledge.",
    "resolution_secondary_themes": {
        "father-son_relationship": "The father-son relationship reaches a poignant resolution as Indiana and his father reconcile, understanding and appreciating each other’s strengths and weaknesses. Their journey together heals old wounds and forges a stronger bond.",
        "faith_vs_reason": "The film concludes by harmonizing faith and reason, suggesting that both are necessary to fully grasp the mysteries of life. Indiana's experiences lead him to accept that some truths transcend scientific understanding, blending his academic rigor with newfound spiritual insight.",
        "legacy_and_identity": "Indiana embraces his legacy while affirming his unique identity. By the end of the film, he honors his father's scholarly contributions and acknowledges his own path as an adventurer and protector of history, merging the past with the present."
    },
    "resolution_tertiary_themes": {
        "good_vs_evil": "The resolution of the good vs. evil theme is achieved as Indiana and his allies thwart the Nazi's plans, reinforcing the triumph of moral righteousness over malevolence. The characters’ victory ensures that knowledge and sacred artifacts are preserved for the benefit of humanity rather than exploited for nefarious purposes.",
        "sacrifice_and_redemption": "Sacrifice and redemption are resolved as characters demonstrate selflessness and courage, ultimately achieving redemption through their noble actions. The willingness to sacrifice personal desires for the greater good underscores the film's moral message.",
        "adventure_and_exploration": "The theme of adventure and exploration is brought to a fulfilling close with the successful completion of the quest. The characters emerge from their journey enriched and enlightened, having discovered not only ancient relics but also profound truths about themselves and the world."
    }
}]